import { Button } from "antd";
import styles from "./SystemMenu.module.css";

export const SystemMenu = () => {
    return (
        <div className={styles.systemMenu}>
            <div className={styles.topSection}>
                <Button className={`button ${styles.menuSection}`}>
                    <div className={styles.menuItem}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path d="M3.33333 2V12.6667H14V14H2V2H3.33333ZM13.2929 3.95956L14.7071 5.37377L10.6667 9.4142L8.66667 7.414L6.04044 10.0405L4.62623 8.6262L8.66667 4.58579L10.6667 6.586L13.2929 3.95956Z" fill="#F2F2F2" />
                        </svg>

                        Отображение
                    </div>
                </Button>

                <Button className={`button ${styles.menuSection}`}>
                    <div className={styles.menuItem}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path d="M11.0002 2C13.0252 2 14.6668 3.66667 14.6668 6C14.6668 10.6667 9.66683 13.3333 8.00016 14.3333C6.68176 13.5423 3.27766 11.7084 1.9125 8.66667H5.04429L5.66683 7.62913L7.66683 10.9625L9.0443 8.66667H11.3335V7.33333H8.28936L7.66683 8.37087L5.66683 5.03757L4.28937 7.33333L1.47366 7.33327C1.38295 6.9084 1.3335 6.4641 1.3335 6C1.3335 3.66667 3.00016 2 5.00016 2C6.24014 2 7.3335 2.66667 8.00016 3.33333C8.66683 2.66667 9.76016 2 11.0002 2Z" fill="#F2F2F2" />
                        </svg>
                        Система оценки
                    </div>
                </Button>

                <Button className={`button ${styles.menuSection}`}>
                    <div className={styles.menuItem}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path d="M11.3332 3.33398V4.66732C12.4378 4.66732 13.3332 5.56275 13.3332 6.66732V14.0007C13.3332 14.3689 13.0347 14.6673 12.6665 14.6673H3.33317C2.96498 14.6673 2.6665 14.3689 2.6665 14.0007V6.66732C2.6665 5.56275 3.56194 4.66732 4.6665 4.66732V3.33398H11.3332ZM8.6665 7.33398H7.33317V8.66732H5.99984V10.0007H7.3325L7.33317 11.334H8.6665L8.66584 10.0007H9.99984V8.66732H8.6665V7.33398ZM12.6665 1.33398V2.66732H3.33317V1.33398H12.6665Z" fill="#F2F2F2" />
                        </svg>
                        Медикаменты
                    </div>
                </Button>

                <Button className={`button ${styles.menuSection}`}>
                    <div className={styles.menuItem}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path d="M8.57727 1.99946L14.9281 12.9995C15.1123 13.3183 15.003 13.7261 14.6841 13.9101C14.5828 13.9687 14.4678 13.9995 14.3508 13.9995H1.64909C1.2809 13.9995 0.982422 13.701 0.982422 13.3328C0.982422 13.2157 1.01323 13.1008 1.07174 12.9995L7.4226 1.99946C7.60667 1.6806 8.0144 1.57135 8.33327 1.75544C8.4346 1.81396 8.5188 1.89812 8.57727 1.99946ZM7.33327 10.6661V11.9995H8.6666V10.6661H7.33327ZM7.33327 5.99946V9.33282H8.6666V5.99946H7.33327Z" fill="#F2F2F2" />
                        </svg>
                        Тревога
                    </div>
                </Button>

                <Button className={`button ${styles.menuSection}`}>
                    <div className={styles.menuItem}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path d="M14.6668 13.334H1.3335V12.0007H2.00016V7.35492C2.00016 4.02964 4.68646 1.33398 8.00016 1.33398C11.3139 1.33398 14.0002 4.02964 14.0002 7.35492V12.0007H14.6668V13.334ZM6.3335 14.0007H9.66683C9.66683 14.9211 8.92063 15.6673 8.00016 15.6673C7.0797 15.6673 6.3335 14.9211 6.3335 14.0007Z" fill="#F2F2F2" />
                        </svg>
                        Уведомления
                    </div>
                </Button>

                <Button className={`button ${styles.menuSection}`}>
                    <div className={styles.menuItem}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path d="M4.66683 11.334H11.3335V14.6673H4.66683V11.334ZM12.6668 13.334V10.0007H3.3335V13.334H2.00016C1.63198 13.334 1.3335 13.0355 1.3335 12.6673V6.00065C1.3335 5.63246 1.63198 5.33398 2.00016 5.33398H14.0002C14.3684 5.33398 14.6668 5.63246 14.6668 6.00065V12.6673C14.6668 13.0355 14.3684 13.334 14.0002 13.334H12.6668ZM3.3335 6.66732V8.00065H5.3335V6.66732H3.3335ZM4.66683 1.33398H11.3335C11.7017 1.33398 12.0002 1.63246 12.0002 2.00065V4.00065H4.00016V2.00065C4.00016 1.63246 4.29864 1.33398 4.66683 1.33398Z" fill="#F2F2F2" />
                        </svg>
                        Печать
                    </div>
                </Button>

                <Button className={`button ${styles.menuSectionLast}`}>
                    <div className={styles.menuItem}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path d="M1.36621 8.66603H5.01816C5.13749 10.8453 5.83826 12.8696 6.968 14.5867C3.99174 14.1242 1.66673 11.6929 1.36621 8.66603ZM1.36621 7.3327C1.66673 4.30588 3.99174 1.8746 6.968 1.41211C5.83826 3.12914 5.13749 5.1535 5.01816 7.3327H1.36621ZM14.6337 7.3327H10.9817C10.8624 5.1535 10.1617 3.12914 9.03193 1.41211C12.0082 1.8746 14.3332 4.30588 14.6337 7.3327ZM14.6337 8.66603C14.3332 11.6929 12.0082 14.1242 9.03193 14.5867C10.1617 12.8696 10.8624 10.8453 10.9817 8.66603H14.6337ZM6.35378 8.66603H9.64613C9.53173 10.5213 8.94306 12.2482 7.99993 13.7271C7.0568 12.2482 6.46819 10.5213 6.35378 8.66603ZM6.35378 7.3327C6.46819 5.47749 7.0568 3.75058 7.99993 2.2717C8.94306 3.75058 9.53173 5.47749 9.64613 7.3327H6.35378Z" fill="#F2F2F2" />
                        </svg>
                        Регион, дата и время
                    </div>
                </Button>
            </div>

            <div className={styles.bottomSection}>
                <Button className={`button ${styles.menuSectionLast}`}>
                    <div className={styles.menuItem}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                            <path d="M3.33317 1.33398H12.6665C13.0347 1.33398 13.3332 1.63246 13.3332 2.00065V14.0007C13.3332 14.3689 13.0347 14.6673 12.6665 14.6673H3.33317C2.96498 14.6673 2.6665 14.3689 2.6665 14.0007V2.00065C2.6665 1.63246 2.96498 1.33398 3.33317 1.33398ZM5.99984 7.33398V5.33398L2.6665 8.00065L5.99984 10.6673V8.66732H9.99984V7.33398H5.99984Z" fill="#F2F2F2" />
                        </svg>

                        Завершить и выйти
                    </div>
                </Button>
            </div>
        </div>
    );
};
